app/views/employees/_form.html.erb

		<div class="col-lg-4">
			<%= f.collection_select :store_id, User.find(session[:user_id]).stores, :id, :nombre, {prompt: "-- Seleccionar una Sucursal --"}, {:class => 'form-control'} %>
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 8 LIMIT 1
SELECT `stores`.* FROM `stores`  WHERE `stores`.`user_id` = 8