app/controllers/employees_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 8 LIMIT 1
SELECT `employees`.* FROM `employees` INNER JOIN `stores` ON `employees`.`store_id` = `stores`.`id` WHERE `stores`.`user_id` = 8
---
  def index
    @empleados = User.find(session[:user_id]).employees

INSERT INTO `employees` (`created_at`, `nombre`, `puesto`, `rfc`, `store_id`, `updated_at`) VALUES ('2014-09-02 19:57:52', 'Jim', 'Manager', 'jjjjjj', 2, '2014-09-02 19:57:52')
---
  def create
    @empleado = Employee.new(employee_params)

    if @empleado.save

SELECT  `employees`.* FROM `employees`  WHERE `employees`.`id` = 0 LIMIT 1
---
  def show
    @empleado = Employee.find(params[:id])

SELECT  `employees`.* FROM `employees`  WHERE `employees`.`id` = 1 LIMIT 1
---
  def edit
    @empleado = Employee.find(params[:id])

SELECT  `employees`.* FROM `employees`  WHERE `employees`.`id` = 2 LIMIT 1
UPDATE `employees` SET `rfc` = 'MMMMM', `store_id` = NULL, `updated_at` = '2014-09-02 19:58:39' WHERE `employees`.`id` = 2
---
  def update
    @empleado = Employee.find(params[:id])

    if @empleado.update(employee_params)

SELECT  `employees`.* FROM `employees`  WHERE `employees`.`id` = 2 LIMIT 1
DELETE FROM `employees` WHERE `employees`.`id` = 2
---
  def destroy
    @empleado = Employee.find(params[:id])
    @empleado.destroy

SELECT  `employees`.* FROM `employees` INNER JOIN `stores` ON `employees`.`store_id` = `stores`.`id` WHERE `stores`.`user_id` = 8 AND `employees`.`nombre` = 'w' LIMIT 1
---
    def EmployeeByNombre
    employee = User.find(session[:user_id]).employees.find_by_nombre(params[:employee_nombre])

SELECT  `employees`.* FROM `employees` INNER JOIN `stores` ON `employees`.`store_id` = `stores`.`id` WHERE `stores`.`user_id` = 8 AND `employees`.`rfc` IS NULL LIMIT 1
---
  def EmployeeByRFC
    employee = User.find(session[:user_id]).employees.find_by_rfc(params[:employee_rfc])