app/controllers/stores_controller.rb

SELECT `stores`.* FROM `stores`
---
  def index
  	@sucursales = Store.all