app/controllers/stores_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 8 LIMIT 1
SELECT `stores`.* FROM `stores`  WHERE `stores`.`user_id` = 8
---
  def index
  	@sucursales = User.find(session[:user_id]).stores