app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO `users` (`contrasena_hash`, `contrasena_salt`, `correo_electronico`, `created_at`, `empresa`, `nombre`, `rfc`, `updated_at`) VALUES ('$2a$10$rCWkkcji/Qq5xJ7dl2pg5u5kpMKPAYVpvd98Ii./H90OHLJNWcMI.', '$2a$10$rCWkkcji/Qq5xJ7dl2pg5u', 'test@test.com', '2014-08-29 23:05:37', 'documentos digitales', 'pedro', 'ffffff', '2014-08-29 23:05:37')

	def UserByEmail
		user = User.find_by_correo_electronico(params[:user_correo_electronico])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`correo_electronico` = 'peter@peter.com' LIMIT 1

	def UserByRFC
		user = User.find_by_rfc(params[:user_rfc])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`rfc` = 'f' LIMIT 1

	def UserByEmpresa
		user = User.find_by_empresa(params[:user_empresa])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`empresa` = 'o' LIMIT 1